Repository: aryx/yacfe
Catalog: tests-ex/c++/grany-2.0.0/po/*.po
Languages: fr

source: Close
fr: Fermer

source: is a simulator of cellular automata for the granular environments
fr: est un simulateur d'automates cellulaires pour les milieux granulaires

source: Authors
fr: Auteurs

source: This program is
fr: Ce logiciel est

source: For further information, consult
fr: Pour plus d'informations, consultez

source: About Grany-3...
fr: A propos de Grany-3...

source: _Scene editor
fr: Editeur de _scène

source: _Borders editor
fr: Editeur de _bordures

source: _Rules editor
fr: Editeur de _règle

source: _Updatable parameters
fr: Paramètres _modifiables

source: <alt>u
fr: <alt>m

source: _Tools
fr: Ou_tils

source: _Play
fr: _Lecture

source: <alt>p
fr: <alt>l

source: Recor_d
fr: En_registrement

source: <alt>d
fr: <alt>r

source: _Control
fr: _Contrôle

source: Play
fr: Lecture

source: Record
fr: Enregistrement

source: Ready.
fr: Prêt.

source: I detected you don't have `~/.grany' directory, but I can't find my installing script... I tried:
fr: J'ai détecté que vous n'avez pas de répertoire `~/.grany', mais je ne trouve pas mon script d'installation... J'ai cherché:

source: Invoking my install script:
fr: J'appelle mon script d'installation:

source: Installation successful. Enjoy!
fr: Installation réussie. Maintenant c'est à vous!

source: A directory `~/.grany' and some subdirs have been created. Please put your creations in its subdirectories. NB: through each window you can access Help / Newbie help which will help you begin with Grany.
fr: Un répertoire `~/.grany' et des sous-répertoires ont été créés. Veuillez placer vos nouveaux fichiers dans les sous-répertoires prévus. NB: dans chaque fenêtre vous pourrez trouver: Aide / Newbie, cela pourra vous aider à commencer.

source: I detected you don't have `~/.grany' directory, but I failed while invoking my script... I tried:
fr: J'ai détécté que vous n'avez pas de répertoire `~/.grany', mais j'ai échoué dans l'appel de mon script... J'ai essayé:

source: This is the main window. Here you will watch a simulation progressing over the time. Please consider opening a .simulation file, -- or defining a new simulation by opening a .scene file and setting up some parameters through the dialogs. Then you will use the stop-play-pause buttons to control the simulation.
fr: Ceci est la fenêtre principale. Ici vous pourrez regarder une simulation se dérouler au cours du temps. Vous pouvez pour cela ouvrir un fichier .simulation, -- ou définir une nouvelle simulation en ouvrant un fichier .scene et en définissant les paramètres à l'aide des dialogues proposés.

source: The value entered for `number of steps' is not valid.
fr: La valeur entrée pour `nombre de pas' est invalide.

source: The value entered for `display frequency' is not valid.
fr: La valeur entrée pour `fréquence d'affichage' est invalide.

source: File not found !
fr: Fichier non trouvé !

source: Computing...
fr: Calculs en cours...

source: Error while reading the file... Are you sure this is a .simul file?
fr: Erreur pendant la lecture du fichier... Etes-vous sûr qu'il s'agit dun fichier .simul ?

source: Fileread failed.
fr: Echec de la lecture.

source: Error while writing the file... Do you have write permission?
fr: Erreur pendant l'écriture du fichier... Avez-vous le droit en écriture ?

source: Grany-3 : new file
fr: Grany-3 : nouveau

source: You have erased the previous file named :
fr: Vous avez écrasé le précédent fichier nommé :

source: Step of the automata :
fr: Pas de l'automate :

source: The value entered for `network size' is not valid. It must be a number.
fr: La valeur entrée pour `dimension du réseau' est invalide. Ce doit être un nombre.

source: The value entered for `network size' is not valid. It must be greater than 0. (and should be smaller than 100 to be viewable)
fr: La valeur entrée pour `dimension du réseau' est invalide. Elle doit être supérieure à 0. (and devrait être inférieure à 100 pour être visible)

source: The value entered for `number of steps' is not valid. It must be a number.
fr: La valeur entrée pour `nombre de pas' est invalide. Elle doit être un nombre.

source: The value entered for `number of steps' is not valid. It must be greater than 0.
fr: La valeur entrée pour `nombre de pas' est invalide. Elle doit être supérieure à 0.

source: The value entered for `seed' is not valid.
fr: La valeur entrée pour `germe' est invalide.

source: Error while reading the file... Are you sure you gave me a .scene file?
fr: Erreur pendant la lecture du fichier... Etes-vous sûr qu'il s'agit d'un fichier .scene ?

source: New
fr: Nouveau

source: Open
fr: Ouvrir

source: Save
fr: Enregistrer

source: Help
fr: Aide

source: _New
fr: _Nouveau

source: _Open
fr: _Ouvrir

source: _Save
fr: Enregi_strer

source: Save as...
fr: Enregistrer sous...

source: _Quit
fr: _Quitter

source: _File
fr: _Fichier

source: Open a file...
fr: Ouvrir un fichier...

source: Write to a file...
fr: Enregistrer un fichier...

source: About _Grany
fr: A propos de _Grany

source: Ne_wbie help!
fr: Aide pour ne_wbie!

source: _Help
fr: _Aide

source: <alt>h
fr: <alt>a

source: Sorry, no newbie help available in this window.
fr: Désolé, pas d'aide pour newbie dans cette fenêtre.

source: engine, file handling, tools (autoconf...)
fr: moteur, fichiers, outils (autoconf...)

source: graphical interface
fr: interface graphique

source: hexagonal algorithms
fr: algorithmes dans le plan hexagonal

source: contribution to the graphical interface
fr: contribution à l'interface graphique

source: contribution to file handling
fr: contribution à la gestion des fichiers

source: Launch the graphical interface of Grany-3
fr: Démarre l'interface graphique de Grany-3

source: disable the (few) warning messages
fr: supprime le (peu de) messages de mises en garde

source: prints a summary of the options
fr: affiche un résumé des options

source: prints the version number
fr: affiche le numéro de version

source: prints the authors
fr: affiche les auteurs

source: Now I can talk like this. Your application will be in english.
fr: Maintenant je parle comme cela. Votre application sera donc en français.

source: Expert mode engaged.
fr: Mode expert enclenché.

source: [Warning!] Unrecognized option on command-line:
fr: [Attention!] Option non-reconnue sur la ligne de commande:

source: Asking gtk to wake up...
fr: Gtk, réveille-toi...

source: No ~/.grany/granyrc, so using common `granyrc'.
fr: Pas de ~/.grany/granyrc, donc j'utilise le `granyrc' commun.

source: Found ~/.grany/granyrc, using it.
fr: J'ai trouvé votre ~/.grany/granyrc, et je l'utilise.

source: Ok. Running now...
fr: Ok. Démarrage de l'application, maintenant...

source: Exiting...
fr: Sortie...

source: Borders editor : new file
fr: Editeur de frontières : nouveau

source: Select
fr: Sélectionner

source: New line
fr: Nouveau segment

source: New arc of ellipse
fr: Nouvel arc d'ellipse

source: New ellipse
fr: Nouvelle ellipse

source: New polygon
fr: Nouveau polygone

source: Delete
fr: Supprimer

source: Create classical borders
fr: Créer des parois classiques

source: Create generating borders
fr: Créer des parois génératrices

source: Grid
fr: Grille

source: _Edit
fr: _Editer

source: Configuration in progress...
fr: Configuration en cours...

source: Error while reading the file... Are you sure this was a borders file?
fr: Erreur pendant la lecture du fichier... Etes-vous sûr qu'il s'agit d'un fichier de frontières ?

source: Borders editor :
fr: Editeur de frontières :

source: Error while writing the file...
fr: Erreur pendant l'écriture du fichier...

source: This is the Borders Editor. Here you will design the borders of a future simulation. You can use several geometrical forms: 1. A line: click-drag-drop. 2. An arc of ellipse: click-drag-drop to setup the first and last points ; then move the pointer to setup the curve. 3. An ellipse: click-drag-drop (holding shift you will create a circle). 4. A polygon: click-drag-drop for the first line, then click for the next ones, then right-click to terminate. Each one of these borders may be: 1. Classical borders. -- or, 2. Generating borders (which means one phase will be able to go through this border).
fr: Ceci est l'éditeur de frontières. Ici vous pourrez définir les frontières de votre future simulation. Vous pouvez utiliser de nombreuses formes géométriques: 1. Un segment: cliquez-tirez-lâchez. 2. Un arc d'ellipse: cliquez-tirez-lâchez pour désigner le premier et le dernier points ; puis bougez le pointeur pour changer la courbe. 3. Une ellipse: cliquez-tirez-lâchez (en maintenant shift vous créerez un cercle). 4. Un polygone: cliquez-tirez-lâchez pour le premier segment, puis cliquez pour les autres, puis cliquez bouton droit pour terminer. Chacune de ces frontières pourra être: 1. Paroi classique. -- ou, 2. Paroi génératrice (ce qui veut dire qu'une phase pourra passer à travers cette paroi).

source: Element selected.
fr: Elément sélectionné.

source: New line, origine : (
fr: Nouveau segment, origine : (

source: ). Drag for the end.
fr: ). Tirer pour l'extrémité terminale.

source: The arc of ellipse is not valid.
fr: L'arc d'ellipse est invalide.

source: Arc of ellipse with a classical border added.
fr: Arc d'ellipse de paroi classique ajouté.

source: Arc of ellipse with a generating border added.
fr: Arc d'ellipse de paroi génératrice ajouté.

source: New arc of ellipse, origine : (
fr: Nouvel arc d'ellipse, origine : (

source: The line is not valid.
fr: Le segment est invalide.

source: Left button for another line, right button to end.
fr: Bouton gauche pour un autre segment, bouton droit pour terminer.

source: The polygone is not valid.
fr: Le polygone est invalide.

source: Polygone with a classical border added.
fr: Polygone de paroi classique ajouté.

source: Polygone with a generating border added.
fr: Polygone de paroi génératrice ajouté.

source: New polygone, origine : (
fr: Nouveau polygone, origine : (

source: ). Drag.
fr: ). Tirer.

source: New ellipse, origine : (
fr: Nouveau segment, origine : (

source: Current position : (
fr: Coordonnées actuelles : (

source: Line with classical border added.
fr: Segment de paroi classique ajouté.

source: Line with generating border added.
fr: Segment de paroi génératrice ajouté.

source: Invalid arc of ellipse.
fr: Arc d'ellipse invalide.

source: Now decide for the centre of the ellipse.
fr: Déterminez maintenant le centre de l'ellipse.

source: The line is not valid. Please give the first line again.
fr: Le segment est invalide. Redonnez le premier segment.

source: The ellipse is not valid.
fr: L'ellipse est invalide.

source: Ellipse with classical border added.
fr: Ellipse avec parois classiques ajoutée.

source: Ellipse with generating border added.
fr: Ellipse avec parois génératrices ajoutée.

source: Element deleted.
fr: Elément supprimé.

source: You can also use the DEL key.
fr: Vous pouvez aussi utiliser la touche SUPPR.

source: Add a new line by clicking for the origine, then dragging for the end.
fr: Ajouter un nouveau segment en cliquant pour l'origine, puis en tirant pour l'extrémité terminale.

source: Add a new arc of ellipse by clicking and dragging to determine the extreme coordinates.
fr: Ajouter un nouvel arc d'ellipse en cliquant et tirant pour déterminer les points extrêmes.

source: Add a new ellipse by clicking and dragging to determine the extreme coordinates.
fr: Ajouter un nouvel arc d'ellipse en cliquant et tirant pour déterminer les points extrêmes.

source: Add a new polygone by clicking and dragging for the first line.
fr: Ajouter un nouveau polygone en cliquant et tirer pour le premier segment.

source: Added borders will be `classical'.
fr: Les parois ajoutées seont de type `classique'.

source: Added borders will be `generating'.
fr: Les parois ajoutées seront de type `génératrices'.

source: The grid is no longer displayed.
fr: La grille ne s'affiche plus.

source: The grid is being displayed.
fr: La grille s'affiche.

source: Modify
fr: Modifier

source: Borders
fr: Frontières

source: Properties
fr: Propriétés

source: Generated
fr: Génératrice

source: Number of phases : 0
fr: Nombre de phases : 0

source: Zoning
fr: Zonage

source: Scene editor : new file
fr: Editeur de scène : nouveau

source: Error while reading the file... Are you sur this was a .scene file?
fr: Erreur pendant la lecture du fichier... Etes-vous sûr qu'il s'agit d'un fichier .scene?

source: Scene editor :
fr: Editeur de scène :

source: You must define at least one border.
fr: Vous devez définir au moins une frontière.

source: You must define at least one phase.
fr: Vous devez définir au moins une phase.

source: You must define a generated phase because you have a generating border.
fr: Vous devez définir une phase génératrice puisque pour avez une paroi génératrice.

source: You must define at least one zoning.
fr: Vous devez définir au moins un zonage.

source: Scene editor
fr: Editeur de scène

source: This is the Scene Editor. Here you will design step-by-step a new scene (ie. a vectorial representation of the future simulation): 1. Design some borders either by opening a borders file or creating a new one from scratch. 2. Design some phases (abstraction for `type of matter') and setup their properties. 3. Design some zonings: they will be the initial positions of the phases. 4. Design some colorations: they will repaint some initial areas with local colors.
fr: Ceci est l'éditeur de scène. Ici vous pourrez définir pas à pas une nouvelle scène (cad. une représentation vectorielle d'une future simulation): 1. Définissez des frontières soit en ouvrant un fichier de frontières soit en en créant de nouvelles depuis le début. 2. Définissez des phases (notre abstraction pour un `type de matière') et leurs propriétés. 3. Définissez des zonages: ils symboliseront l'emplacement initial des phases. 4. Définissez des colorations: ils symboliseront des zones initiales repeintes d'une couleur donnée.

source: Open a borders file...
fr: Ouvrir un fichier de frontières

source: No phase selected.
fr: Pas de phase sélectionnée.

source: Number of phases :
fr: Nombre de phases :

source: Newphase
fr: Nouvellephase

source: Rules editor
fr: Editeur de règle

source: Same Phi
fr: Même phi

source: Lower than solid Phi
fr: Phi inférieur à Phi solide

source: Lower Phi
fr: Phi inférieur

source: Any Phi
fr: N'importe quel phi

source: Ready
fr: Prêt.

source: Now, to enable the rule, that cell must be `same phi'
fr: Maintenant, pour activer cette règle, cette cellule doit avoir `même phi'

source: Now, to enable the rule, that cell must be `phi inf solid'
fr: Maintenant, pour activer cette règle, cette cellule doit avoir `phi inférieur à phi solide'

source: Now, to enable the rule, that cell must be `phi inf'
fr: Maintenant, pour activer cette règle, cette cellule doit avoir `phi inférieur'

source: Now, there is no constraint on this cell
fr: Maintenant, il n'y a plus de contrainte sur cette cellule

source: Now, this movement is allowed
fr: Maintenant, ce mouvement est autorisé.

source: Now, this movement is forbidden
fr: Maintenant, ce mouvement est interdit

source: Rules editor : new file
fr: Editeur de règles : nouveau

source: Error while reading the file... Are you sure this was a rule file?
fr: Erreur pendant la lecture... Etes-vous sûr qu'il s'agissait d'un fichier .regle ?

source: Rules editor :
fr: Editeur de règle :

source: The value entered for `name' is not valid. It must not contain spaces nor special characters.
fr: La valeur entrée pour `nom' est invalide. Elle ne doit pas contenir d'espaces ni de caractères spéciaux.

source: This is the Rules Editor. Here you will design an exclusion rule applicable to the phases. To setup your rule, you may: 1. dictate conditions on the neighbourhood by the colors symbols. 2. forbid some movements by clicking on the arrows.
fr: Ceci est l'éditeur de règles. Ici vous définirez une règle d'exclusion applicable aux phases. Pour définir votre règle, vous pouvez: 1. Poser des conditions sur le voisinage, avec les symboles de couleur. 2. Interdire certains mouvements, en cliquant sur les flèches.

source: Clic on a bubble to set it `same phi'
fr: Cliquez sur une boule pour la mettre `même phi'

source: Clic on a bubble to set it `lower than solid Phi'
fr: Cliquez sur une boule pour la mettre `phi inférieur à phi solide'

source: Clic on a bubble to set it `lower phi'
fr: Cliquez sur une boule pour la mettre `phi inférieur'

source: Clic on a bubble to set it `any phi'
fr: Cliquez sur une boule pour la mettre `n'importe quel phi'

source: Scene name
fr: Nom de la scène

source: Parameters
fr: Paramètres

source: Cancel
fr: Annuler

source: Browse...
fr: Parcourir...

source: Network size
fr: Dimension du réseau

source: Number of steps
fr: Nombre de pas

source: Seed
fr: Germe

source: New simulation
fr: Nouvelle simulation

source: Open a scene file...
fr: Ouvrir un fichier .scene...

source: General
fr: Général

source: Display frequency
fr: Fréquence d'affichage

source: Apply changes
fr: Appliquer les changements

source: Updatable parameters
fr: Paramètres modifiables

source: Name of output file
fr: Nom du fichier de sortie

source: Recording parameters
fr: Paramètres de l'enregistrement

source: Sorry, not implemented.
fr: Désolé, non implémenté.

source: The phase is solid
fr: La phase est solide

source: The phase is fluid
fr: La phase est fluide

source: Name :
fr: Nom :

source: Inertia :
fr: Inertie :

source: Color
fr: Couleur

source: Rules
fr: Règles

source: Usable rules
fr: Règles disponibles

source: Pre-exclusion rules
fr: Règles en pré-exclusion

source: Post-exclusion rules
fr: Règles en post-exclusion

source: Design new rule
fr: Nouvelle règle

source: Add in pre
fr: Ajouter en pré

source: Add in post
fr: Ajouter en post

source: Remove from pre
fr: Enlever de pré

source: Remove from post
fr: Enlever de post

source: Ponderations
fr: Pondérations

source: North
fr: Nord

source: South
fr: Sud

source: North-east
fr: Nord-est

source: North-west
fr: Nord-ouest

source: South-east
fr: Sud-est

source: South-west
fr: Sud-ouest

source: Phases parameters
fr: Paramètres des phases

source: Please choose a color...
fr: Choisissez une couleur...

source: Please save the rule in the rules editor
fr: Sauvegardez la règle, dans l'éditeur de règle

source: Error while reading the rule file. Reinstall Microsoft Windows. (seriously, you're in trouble)
fr: Erreur pendant la lecture du fichier de règle. Réinstallez Windows. (sérieusement, vous êtes mal)

source: No rule selected.
fr: Pas de règle sélectionnée.

source: The value entered for `name' is not valid. It must not be void.
fr: La valeur entrée pour `nom' est invalide. Elle ne doit pas être vide.

source: The value entered for `name' is not valid. It must be different from the other phases names.
fr: La valeur entrée pour `nom' est invalide. Elle doit être différente du nom des autres phases.

source: The value entered for `inertie' is not valid. It must be a number.
fr: La valeur entrée pour `inertie' est invalide. Elle doit être un nombre.

source: The value entered for `North' is not valid. It must be a number.
fr: La valeur entrée pour `Nord' est invalide. Elle doit être un nombre

source: The value entered for `North east' is not valid. It must be a number.
fr: La valeur entrée pour `Nord est' est invalide. Elle doit être un nombre

source: The value entered for `North west' is not valid. It must be a number.
fr: La valeur entrée pour `Nord ouest' est invalide. Elle doit être un nombre

source: The value entered for `South' is not valid. It must be a number.
fr: La valeur entrée pour `Sud' est invalide. Elle doit être un nombre

source: The value entered for `South east' is not valid. It must be a number.
fr: La valeur entrée pour `Sud est' est invalide. Elle doit être un nombre

source: The value entered for `South west' is not valid. It must be a number.
fr: La valeur entrée pour `Sud ouest' est invalide. Elle doit être un nombre

source: Relative mix of phases:
fr: Proportion relative des phases:

source: Apply mix to selected area
fr: Appliquer le mélange au zonage sélectionné.

source: Zoning editor
fr: Editeur de zonage

source: This is the Zoning Editor. Here you will setup the initial positions of the phases: 1. Setup the desired phases mix with the sliders on the right. 2. Create your geometrical filled form: a. A rectangle or an ellipse by click-drag-drop. b. A polygon by click-drag-drop, then clicks, then right-click.
fr: Ceci est l'éditeur de zonages Ici vous pourrez définir les emplacements initiaux des phases: 1. Définissez la répartition relative voulue entre les phases. 2. Créez une forme géométrique pleine: a. Un rectangle ou une ellipse en cliquant-tirant-lachant. b. Un polygone en cliquant-tirant-lachant, puis cliquant plusieurs fois, puis cliquant avec le bouton droit.

source: New rectangle, origine : (
fr: Nouveau segment, origine : (

source: You must have at least a little bit of one phase !
fr: Vous devez avoir au moins un peu d'une phase !

source: The rectangle is not valid.
fr: Le segment est invalide.

source: Rectangle added.
fr: Rectangle ajouté.

source: No area selected !
fr: Elément sélectionné.

source: An error has occured...
fr: Une erreur est survenue...

source: Error
fr: Erreur

source: New rectangle
fr: Nouveau rectangle

source: Add a new rectangle by clicking for the origine, then dragging for the end.
fr: Ajouter un nouveau segment en cliquant pour l'origine, puis en tirant pour l'extrémité terminale.

source: Add a new ellipse by clicking and dragging.
fr: Ajouter un nouveau polygone en cliquant et tirer pour le premier segment.

source: Choose color
fr: Choisir la couleur

source: Automatic random color
fr: Tirer une couleur au hasard

source: Coloration editor
fr: Editeur de coloration

source: This is the Coloration Editor. Here you will setup color paintings on some areas: 1. Setup the desired color. 2. Create your geometrical filled form: a. A rectangle or an ellipse by click-drag-drop. b. A polygon by click-drag-drop, then clicks, then right-click.
fr: Ceci est l'éditeur de coloration. Ici vous pourrez définir des zones initiales de même couleur: 1. Définissez la couleur voulue. 2. Créez la forme géométrique désirée: a. Un rectangle ou une ellipse en cliquant-tirant-lachant. b. Un polygone en cliquant-tirant-lachant, puis cliquant plusieurs fois, puis cliquant avec le bouton droit.

source: A newbie! has occured...
fr: Un newbie! est survenu...

source: You did not specify the network size.
fr: Vous n'avez pas spécifié la dimension du réseau.

source: This is
fr: C'est

source: the celullar automaton simulator.
fr: the simulateur d'automate cellulaire.

source: Launch the simulation or the scene from FILE or standard input
fr: Lance la simulation ou la scene à partir de FICHIER ou de l'entrée standard

source: seed of the simulation
fr: germe de la simulation

source: number of steps of the simulation
fr: nombre de pas de la simulation

source: if the argument is a scene, gives the dimension of the network
fr: si l'argument est une scène, donne la dimension du réseau

source: file handling, engine, tools (configure...)
fr: gestion des fichiers, moteur, outils (configure...)
